#include <stdio.h>

int main()
{
    int row, col;               // সারি এবং কলাম সংরক্ষণের জন্য ইন্টিজার ভেরিয়েবল ডিক্লেয়ার করা হলো
    scanf("%d %d", &row, &col); // ব্যবহারকারীর কাছ থেকে সারি এবং কলামের মান নেওয়া হলো

    int arr[row][col]; // ব্যবহারকারীর দেওয়া সারি এবং কলাম অনুযায়ী একটি ২ডি অ্যারে ডিক্লেয়ার করা হলো

    // প্রথম লুপ: অ্যারের প্রতিটি সারির জন্য
    for (int i = 0; i < row; i++)
    {
        // দ্বিতীয় লুপ: অ্যারের প্রতিটি কলামের জন্য
        for (int j = 0; j < col; j++)
        {
            scanf("%d", &arr[i][j]); // অ্যারের বর্তমান [i][j] পজিশনে ব্যবহারকারীর কাছ থেকে ইন্টিজার মান নেওয়া হলো
        }
    }

    // প্রথম লুপ: অ্যারের প্রতিটি সারির জন্য (প্রিন্ট করার উদ্দেশ্যে)
    for (int i = 0; i < row; i++)
    {
        // দ্বিতীয় লুপ: অ্যারের প্রতিটি কলামের জন্য (প্রিন্ট করার উদ্দেশ্যে)
        for (int j = 0; j < col; j++)
        {
            printf("%d ", arr[i][j]); // অ্যারের বর্তমান [i][j] পজিশনের মান প্রিন্ট করা হলো, সাথে একটি স্পেস
        }
        printf("\n"); // একটি সারি প্রিন্ট করা শেষ হলে নতুন লাইন প্রিন্ট করা হলো
    }

    return 0; // প্রোগ্রাম সফলভাবে শেষ হয়েছে বোঝানোর জন্য ০ রিটার্ন করা হলো
}