#include <stdio.h>
int main()
{
    int n;
    scanf("%d", &n); // একটি পূর্ণসংখ্যা ইনপুট নিচ্ছে যা অ্যারের আকার হবে
    int array[n]; // 'n' আকারের একটি পূর্ণসংখ্যার অ্যারে ঘোষণা করা হচ্ছে
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &array[i]); // অ্যারের প্রতিটি উপাদানের জন্য পূর্ণসংখ্যা ইনপুট নিচ্ছে
    }
    int i = 0, j = n - 1; // দুটি পূর্ণসংখ্যা ভেরিয়েবল শুরু করা হচ্ছে, 'i' শুরুতে এবং 'j' শেষে
    while (i < j) // যতক্ষণ 'i', 'j' এর চেয়ে ছোট ততক্ষণ এই লুপ চলবে
    {
        int temporary = array[i]; // 'temporary' ভেরিয়েবলে array[i] এর মান সংরক্ষণ করা হচ্ছে
        array[i] = array[j]; // array[j] এর মান array[i] তে রাখা হচ্ছে
        array[j] = temporary; // 'temporary' এর মান array[j] তে রাখা হচ্ছে (উপাদান দুটি অদলবদল করা হচ্ছে)
        i++; // 'i' এর মান এক বাড়ানো হচ্ছে, যাতে এটি অ্যারের মাঝখানের দিকে অগ্রসর হয়
        j--; // 'j' এর মান এক কমানো হচ্ছে, যাতে এটিও অ্যারের মাঝখানের দিকে অগ্রসর হয়
    }
    for (int i = 0; i < n; i++)
    {
        printf("%d ", array[i]); // উল্টানো অ্যারের প্রতিটি উপাদান প্রিন্ট করা হচ্ছে
    }

    return 0;
}